SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/3MCC0XTOUB/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTD!ICESMSLB\/CRT.LB!1539273721231!6785!131073</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2018-12-01T20:45" ArrivalDateTime="2018-12-02T09:55" FlightNumber="7322" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="CDG"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AI" FlightNumber="7322"/>      <OperatingAirline Code="AC"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-02T21:30" ArrivalDateTime="2018-12-03T10:00" FlightNumber="142" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="788"/>      <MarketingAirline Code="AI" FlightNumber="142"/>      <OperatingAirline Code="AI"/>      <OriginLocation   LocationCode="CDG"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-08T02:15" ArrivalDateTime="2018-12-08T06:30" FlightNumber="161" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="788"/>      <MarketingAirline Code="AI" FlightNumber="161"/>      <OperatingAirline Code="AI"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-12-08T12:00" ArrivalDateTime="2018-12-08T14:55" FlightNumber="7343" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="YYZ"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AI" FlightNumber="7343"/>      <OperatingAirline Code="AC"/>      <OriginLocation   LocationCode="LHR"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>